---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.SetAllCapsStatus(System.Boolean)
source: html/b5469022-01b8-d5cb-5f3d-7a418fa37dd6.htm
---
# Autodesk.Revit.DB.FormattedText.SetAllCapsStatus Method

Sets the characters in the entire text to be in all caps or not.

## Syntax (C#)
```csharp
public void SetAllCapsStatus(
	bool isAllCaps
)
```

## Parameters
- **isAllCaps** (`System.Boolean`) - The desired all caps status of characters in the entire text.
 True to set all capped, false to set not all capped.